from task1 import decrypt_text


if __name__ == '__main__':

    # task 1
    encrypted_text = ("Єщеу х ещєщ зщхєбожцж б хбиєбожцж джмеуєу, тґ Ґуизж Дщїснаг, лжн хбє б ежджшаг. "
                      "Зжіадус гжцж, їж хіщ жшєж, пж г іуе вшй, — жшґуяух жїуеує")
    k = 23

    result = decrypt_text(encrypted_text, k)

    print(result)
    print(result == "Нема в мене певнішого і вірнішого лоцмана, як Карпо Летючий, хоч він і молодий. "
                    "Посилаю його, то все одно, що й сам їду, — одказав отаман")

